"""
1.Декларативность(2+2)
Декларати́вное программи́рование — парадигма программирования,
в которой задаётся спецификация решения задачи, то есть описывается ожидаемый результат, а не способ его получения.

2.Идемпотентность
Это свойство системы или процедуры, которое означает, что ее результаты не зависят от внешних факторов
и не изменяются при повторных вызовах с теми же входными данными.
Например, если функция считает сумму двух чисел, то она идемпотентна, поскольку ее результат не зависит от внешних факторов и всегда будет таким же
при повторных вызовах с теми же входными данными.
"""
